In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("100 Sales Records.csv")

In [7]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [9]:
df.shape

(100, 14)

In [12]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [14]:
df.columns

Index(['Region', 'Country', 'Item Type', 'Sales Channel', 'Order Priority',
       'Order Date', 'Order ID', 'Ship Date', 'Units Sold', 'Unit Price',
       'Unit Cost', 'Total Revenue', 'Total Cost', 'Total Profit'],
      dtype='object')

In [15]:
df.shape

(100, 14)

In [16]:
df.dtypes

Region             object
Country            object
Item Type          object
Sales Channel      object
Order Priority     object
Order Date         object
Order ID            int64
Ship Date          object
Units Sold          int64
Unit Price        float64
Unit Cost         float64
Total Revenue     float64
Total Cost        float64
Total Profit      float64
dtype: object

In [17]:
df.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

In [18]:
df.isnull().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

In [25]:
df.groupby("Region")["Total Profit"].mean()

Region
Asia                                 555804.170000
Australia and Oceania                429287.275455
Central America and the Caribbean    406701.121429
Europe                               503769.937727
Middle East and North Africa         576119.186000
North America                        485980.920000
Sub-Saharan Africa                   338422.538889
Name: Total Profit, dtype: float64

___Phase2___

In [4]:
df_clear = df.dropna()

In [42]:
CS=pd.read_csv("Cleaned_DataFrame.csv")

In [43]:
CS.head()

   Unnamed: 0  Name   Age    City
0           0   Ali   NaN  Tehran
1           1  Reza  30.0  Kashan

In [44]:
CS.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
City          0
dtype: int64

In [45]:
CS["Age"]=CS["Age"].fillna(0)

In [46]:
CS.head()

   Unnamed: 0  Name   Age    City
0           0   Ali   0.0  Tehran
1           1  Reza  30.0  Kashan

In [17]:
FixCS=CS.dropna()

In [18]:
FixCS.head()

   Unnamed: 0  Name   Age    City
1           1  Reza  30.0  Kashan

In [48]:
df["Order Date"]=pd.to_datetime(df["Order Date"])

df['Order Date'].head()

In [52]:
df = df.drop(columns=['Order ID'])

In [ ]:
df.head()

__Phaze3__

In [54]:
revenue_sales=df.groupby("Country")["Total Revenue"].sum()

In [56]:
print(revenue_sales)

Country
Albania            247956.32
Angola            2798046.49
Australia         2489933.49
Austria           1244708.40
Azerbaijan        4478800.21
                     ...
The Gambia        5449517.95
Turkmenistan      5822036.20
Tuvalu            2533654.00
United Kingdom     188452.14
Zambia             623289.30
Name: Total Revenue, Length: 76, dtype: float64

In [57]:
AVF_revenue_sales=df.groupby("Country")["Total Revenue"].mean()

In [58]:
print(AVF_revenue_sales)

Country
Albania           2.479563e+05
Angola            2.798046e+06
Australia         8.299778e+05
Austria           1.244708e+06
Azerbaijan        2.239400e+06
                      ...
The Gambia        1.362379e+06
Turkmenistan      2.911018e+06
Tuvalu            2.533654e+06
United Kingdom    1.884521e+05
Zambia            6.232893e+05
Name: Total Revenue, Length: 76, dtype: float64

In [60]:
Compare_reve_profit=df.groupby("Country")[["Total Revenue","Total Profit"]].sum()

In [61]:
print(Compare_reve_profit)

                Total Revenue  Total Profit
Country
Albania             247956.32     166635.36
Angola             2798046.49     693911.51
Australia          2489933.49     576605.12
Austria            1244708.40     495007.89
Azerbaijan         4478800.21    1512926.83
...                       ...           ...
The Gambia         5449517.95    1385883.27
Turkmenistan       5822036.20    1267258.40
Tuvalu             2533654.00     951410.50
United Kingdom      188452.14      46735.86
Zambia              623289.30     225246.90

[76 rows x 2 columns]